{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution3D", "config": {"name": "convolution3d_1", "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "kernel_dim3": 3, "input_dtype": "float32", "b_constraint": null, "W_regularizer": null, "subsample": [1, 1, 1], "W_constraint": null, "activation": "relu", "nb_filter": 32, "kernel_dim1": 3, "kernel_dim2": 3, "bias": true, "border_mode": "same", "dim_ordering": "tf", "batch_input_shape": [null, 32, 32, 10, 1]}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_2", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "kernel_dim1": 3, "nb_filter": 32, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1, 1], "activation": "relu", "kernel_dim2": 3, "kernel_dim3": 3, "activity_regularizer": null, "bias": true, "border_mode": "same", "dim_ordering": "tf"}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_1", "pool_size": [3, 3, 3], "trainable": true, "dim_ordering": "tf", "strides": [3, 3, 3], "border_mode": "same"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.25, "trainable": true}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_3", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "kernel_dim1": 3, "nb_filter": 64, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1, 1], "activation": "relu", "kernel_dim2": 3, "kernel_dim3": 3, "activity_regularizer": null, "bias": true, "border_mode": "same", "dim_ordering": "tf"}}, {"class_name": "Convolution3D", "config": {"name": "convolution3d_4", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "kernel_dim1": 3, "nb_filter": 64, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1, 1], "activation": "relu", "kernel_dim2": 3, "kernel_dim3": 3, "activity_regularizer": null, "bias": true, "border_mode": "same", "dim_ordering": "tf"}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_2", "pool_size": [3, 3, 3], "trainable": true, "dim_ordering": "tf", "strides": [3, 3, 3], "border_mode": "same"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "b_regularizer": null, "init": "normal", "trainable": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "activation": "relu", "input_dim": 2048, "activity_regularizer": null, "bias": true, "output_dim": 512}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "b_regularizer": null, "init": "normal", "trainable": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "activation": "linear", "input_dim": 512, "activity_regularizer": null, "bias": true, "output_dim": 10}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "softmax", "trainable": true}}]}