{"config": [{"class_name": "Conv3D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "linear", "batch_input_shape": [null, 32, 32, 2, 3], "trainable": true, "dilation_rate": [1, 1, 1], "bias_regularizer": null, "strides": [1, 1, 1], "activity_regularizer": null, "name": "conv3d_1", "dtype": "float32", "use_bias": true, "kernel_size": [3, 3, 3], "filters": 32, "data_format": "channels_last", "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.30000001192092896}}, {"class_name": "Conv3D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3, 3], "kernel_regularizer": null, "filters": 32, "dilation_rate": [1, 1, 1], "bias_regularizer": null, "strides": [1, 1, 1], "name": "conv3d_2", "activation": "linear", "use_bias": true, "trainable": true, "data_format": "channels_last", "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.30000001192092896}}, {"class_name": "MaxPooling3D", "config": {"pool_size": [3, 3, 3], "strides": [3, 3, 3], "padding": "same", "data_format": "channels_last", "name": "max_pooling3d_1", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "trainable": true}}, {"class_name": "Conv3D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3, 3], "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1, 1], "bias_regularizer": null, "strides": [1, 1, 1], "name": "conv3d_3", "activation": "linear", "use_bias": true, "trainable": true, "data_format": "channels_last", "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.30000001192092896}}, {"class_name": "Conv3D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3, 3], "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1, 1], "bias_regularizer": null, "strides": [1, 1, 1], "name": "conv3d_4", "activation": "linear", "use_bias": true, "trainable": true, "data_format": "channels_last", "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.30000001192092896}}, {"class_name": "MaxPooling3D", "config": {"pool_size": [3, 3, 3], "strides": [3, 3, 3], "padding": "same", "data_format": "channels_last", "name": "max_pooling3d_2", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_2", "trainable": true}}, {"class_name": "Conv3D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3, 3], "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1, 1], "bias_regularizer": null, "strides": [1, 1, 1], "name": "conv3d_5", "activation": "linear", "use_bias": true, "trainable": true, "data_format": "channels_last", "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.30000001192092896}}, {"class_name": "Conv3D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_size": [3, 3, 3], "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1, 1], "bias_regularizer": null, "strides": [1, 1, 1], "name": "conv3d_6", "activation": "linear", "use_bias": true, "trainable": true, "data_format": "channels_last", "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.30000001192092896}}, {"class_name": "MaxPooling3D", "config": {"pool_size": [3, 3, 3], "strides": [3, 3, 3], "padding": "same", "data_format": "channels_last", "name": "max_pooling3d_3", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_3", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "activation": "relu", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "name": "dense_1", "use_bias": true, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "beta_constraint": null, "momentum": 0.99, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_4", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 101, "activation": "softmax", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "name": "dense_2", "use_bias": true, "bias_constraint": null}}], "keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential"}