{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "nb_filter": 32, "b_constraint": null, "W_regularizer": null, "bias": true, "input_dtype": "float32", "trainable": true, "dim_ordering": "tf", "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "batch_input_shape": [null, 32, 32, 1], "subsample": [1, 1], "nb_col": 3, "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "nb_filter": 32, "b_constraint": null, "W_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "subsample": [1, 1], "nb_col": 3, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "nb_filter": 64, "b_constraint": null, "W_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "subsample": [1, 1], "nb_col": 3, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "nb_filter": 64, "b_constraint": null, "W_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "subsample": [1, 1], "nb_col": 3, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "output_dim": 512, "b_constraint": null, "W_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": 2304, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_2", "output_dim": 101, "b_constraint": null, "W_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": 512, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "softmax"}}]}