{"class_name": "Sequential", "config": [{"class_name": "Convolution3D", "config": {"batch_input_shape": [null, 32, 32, 10, 1], "activation": "relu", "kernel_dim3": 3, "activity_regularizer": null, "trainable": true, "nb_filter": 32, "W_regularizer": null, "kernel_dim1": 3, "input_dtype": "float32", "bias": true, "kernel_dim2": 3, "b_constraint": null, "subsample": [1, 1, 1], "name": "convolution3d_1", "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "same", "init": "glorot_uniform"}}, {"class_name": "Convolution3D", "config": {"nb_filter": 32, "activation": "relu", "kernel_dim3": 3, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "kernel_dim1": 3, "bias": true, "kernel_dim2": 3, "b_constraint": null, "subsample": [1, 1, 1], "name": "convolution3d_2", "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "same", "init": "glorot_uniform"}}, {"class_name": "MaxPooling3D", "config": {"pool_size": [3, 3, 3], "name": "maxpooling3d_1", "border_mode": "same", "trainable": true, "dim_ordering": "tf", "strides": [3, 3, 3]}}, {"class_name": "Dropout", "config": {"p": 0.25, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution3D", "config": {"nb_filter": 64, "activation": "relu", "kernel_dim3": 3, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "kernel_dim1": 3, "bias": true, "kernel_dim2": 3, "b_constraint": null, "subsample": [1, 1, 1], "name": "convolution3d_3", "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "same", "init": "glorot_uniform"}}, {"class_name": "Convolution3D", "config": {"nb_filter": 64, "activation": "relu", "kernel_dim3": 3, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "kernel_dim1": 3, "bias": true, "kernel_dim2": 3, "b_constraint": null, "subsample": [1, 1, 1], "name": "convolution3d_4", "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "border_mode": "same", "init": "glorot_uniform"}}, {"class_name": "MaxPooling3D", "config": {"pool_size": [3, 3, 3], "name": "maxpooling3d_2", "border_mode": "same", "trainable": true, "dim_ordering": "tf", "strides": [3, 3, 3]}}, {"class_name": "Dropout", "config": {"p": 0.25, "name": "dropout_2", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 2048, "activation": "relu", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_constraint": null, "bias": true, "name": "dense_1", "output_dim": 512, "W_constraint": null, "b_regularizer": null, "init": "normal"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 512, "activation": "linear", "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_constraint": null, "bias": true, "name": "dense_2", "output_dim": 101, "W_constraint": null, "b_regularizer": null, "init": "normal"}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}], "keras_version": "1.2.0"}