{"backend": "tensorflow", "config": [{"config": {"bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "name": "conv3d_1", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "batch_input_shape": [null, 32, 32, 2, 3], "trainable": true, "strides": [1, 1, 1], "bias_constraint": null, "data_format": "channels_last", "padding": "same", "activation": "linear", "activity_regularizer": null, "filters": 32, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1, 1]}, "class_name": "Conv3D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "name": "conv3d_2", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1, 1], "trainable": true, "data_format": "channels_last", "filters": 32, "padding": "same", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1, 1]}, "class_name": "Conv3D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "padding": "same", "name": "max_pooling3d_1", "strides": [3, 3, 3], "trainable": true, "pool_size": [3, 3, 3]}, "class_name": "MaxPooling3D"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "name": "conv3d_3", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1, 1], "trainable": true, "data_format": "channels_last", "filters": 64, "padding": "same", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1, 1]}, "class_name": "Conv3D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "name": "conv3d_4", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1, 1], "trainable": true, "data_format": "channels_last", "filters": 64, "padding": "same", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1, 1]}, "class_name": "Conv3D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "padding": "same", "name": "max_pooling3d_2", "strides": [3, 3, 3], "trainable": true, "pool_size": [3, 3, 3]}, "class_name": "MaxPooling3D"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "name": "conv3d_5", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1, 1], "trainable": true, "data_format": "channels_last", "filters": 64, "padding": "same", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1, 1]}, "class_name": "Conv3D"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "name": "conv3d_6", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1, 1], "trainable": true, "data_format": "channels_last", "filters": 64, "padding": "same", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1, 1]}, "class_name": "Conv3D"}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "padding": "same", "name": "max_pooling3d_3", "strides": [3, 3, 3], "trainable": true, "pool_size": [3, 3, 3]}, "class_name": "MaxPooling3D"}, {"config": {"rate": 0.25, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "use_bias": true, "units": 512, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "use_bias": true, "units": 101, "name": "dense_2", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "softmax", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "keras_version": "2.0.8", "class_name": "Sequential"}