{"keras_version": "1.2.0", "config": [{"class_name": "Merge", "config": {"mode_type": "raw", "mode": "ave", "output_shape": null, "name": "merge_1", "output_shape_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_mask": null, "output_mask_type": "raw", "arguments": {}, "layers": [{"class_name": "Sequential", "config": [{"config": {"batch_input_shape": [null, 32, 32, 10, 3], "kernel_dim3": 3, "b_regularizer": null, "nb_filter": 32, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_1", "activity_regularizer": null, "input_dtype": "float32", "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "bias": true}, "class_name": "Convolution3D"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_2", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 32}, "class_name": "Convolution3D"}, {"config": {"strides": [3, 3, 3], "name": "maxpooling3d_1", "pool_size": [3, 3, 3], "border_mode": "same", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_3", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 64}, "class_name": "Convolution3D"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_4", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 64}, "class_name": "Convolution3D"}, {"config": {"strides": [3, 3, 3], "name": "maxpooling3d_2", "pool_size": [3, 3, 3], "border_mode": "same", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"init": "normal", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 2048, "name": "dense_1", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "relu", "output_dim": 512}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "normal", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 512, "name": "dense_2", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "linear", "output_dim": 101}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}]}, {"class_name": "Sequential", "config": [{"config": {"batch_input_shape": [null, 32, 32, 10, 3], "kernel_dim3": 3, "b_regularizer": null, "nb_filter": 32, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_5", "activity_regularizer": null, "input_dtype": "float32", "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "bias": true}, "class_name": "Convolution3D"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_6", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 32}, "class_name": "Convolution3D"}, {"config": {"strides": [3, 3, 3], "name": "maxpooling3d_3", "pool_size": [3, 3, 3], "border_mode": "same", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_7", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 64}, "class_name": "Convolution3D"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_8", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 64}, "class_name": "Convolution3D"}, {"config": {"strides": [3, 3, 3], "name": "maxpooling3d_4", "pool_size": [3, 3, 3], "border_mode": "same", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "name": "dropout_5", "p": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"init": "normal", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 2048, "name": "dense_3", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "relu", "output_dim": 512}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_6", "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "normal", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 512, "name": "dense_4", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "linear", "output_dim": 101}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_2", "activation": "softmax"}, "class_name": "Activation"}]}, {"class_name": "Sequential", "config": [{"config": {"batch_input_shape": [null, 32, 32, 10, 3], "kernel_dim3": 3, "b_regularizer": null, "nb_filter": 32, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_9", "activity_regularizer": null, "input_dtype": "float32", "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "bias": true}, "class_name": "Convolution3D"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_10", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 32}, "class_name": "Convolution3D"}, {"config": {"strides": [3, 3, 3], "name": "maxpooling3d_5", "pool_size": [3, 3, 3], "border_mode": "same", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "name": "dropout_7", "p": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_11", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 64}, "class_name": "Convolution3D"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_12", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 64}, "class_name": "Convolution3D"}, {"config": {"strides": [3, 3, 3], "name": "maxpooling3d_6", "pool_size": [3, 3, 3], "border_mode": "same", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "name": "dropout_8", "p": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_3"}, "class_name": "Flatten"}, {"config": {"init": "normal", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 2048, "name": "dense_5", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "relu", "output_dim": 512}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_9", "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "normal", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 512, "name": "dense_6", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "linear", "output_dim": 101}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_3", "activation": "softmax"}, "class_name": "Activation"}]}, {"class_name": "Sequential", "config": [{"config": {"batch_input_shape": [null, 32, 32, 10, 3], "kernel_dim3": 3, "b_regularizer": null, "nb_filter": 32, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_13", "activity_regularizer": null, "input_dtype": "float32", "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "bias": true}, "class_name": "Convolution3D"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_14", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 32}, "class_name": "Convolution3D"}, {"config": {"strides": [3, 3, 3], "name": "maxpooling3d_7", "pool_size": [3, 3, 3], "border_mode": "same", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "name": "dropout_10", "p": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_15", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 64}, "class_name": "Convolution3D"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_16", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 64}, "class_name": "Convolution3D"}, {"config": {"strides": [3, 3, 3], "name": "maxpooling3d_8", "pool_size": [3, 3, 3], "border_mode": "same", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "name": "dropout_11", "p": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_4"}, "class_name": "Flatten"}, {"config": {"init": "normal", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 2048, "name": "dense_7", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "relu", "output_dim": 512}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_12", "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "normal", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 512, "name": "dense_8", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "linear", "output_dim": 101}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "softmax"}, "class_name": "Activation"}]}, {"class_name": "Sequential", "config": [{"config": {"batch_input_shape": [null, 32, 32, 10, 3], "kernel_dim3": 3, "b_regularizer": null, "nb_filter": 32, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_17", "activity_regularizer": null, "input_dtype": "float32", "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "bias": true}, "class_name": "Convolution3D"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_18", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 32}, "class_name": "Convolution3D"}, {"config": {"strides": [3, 3, 3], "name": "maxpooling3d_9", "pool_size": [3, 3, 3], "border_mode": "same", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "name": "dropout_13", "p": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_19", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 64}, "class_name": "Convolution3D"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_20", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 64}, "class_name": "Convolution3D"}, {"config": {"strides": [3, 3, 3], "name": "maxpooling3d_10", "pool_size": [3, 3, 3], "border_mode": "same", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "name": "dropout_14", "p": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_5"}, "class_name": "Flatten"}, {"config": {"init": "normal", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 2048, "name": "dense_9", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "relu", "output_dim": 512}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_15", "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "normal", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 512, "name": "dense_10", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "linear", "output_dim": 101}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "softmax"}, "class_name": "Activation"}]}, {"class_name": "Sequential", "config": [{"config": {"batch_input_shape": [null, 32, 32, 10, 3], "kernel_dim3": 3, "b_regularizer": null, "nb_filter": 32, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_21", "activity_regularizer": null, "input_dtype": "float32", "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "bias": true}, "class_name": "Convolution3D"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_22", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 32}, "class_name": "Convolution3D"}, {"config": {"strides": [3, 3, 3], "name": "maxpooling3d_11", "pool_size": [3, 3, 3], "border_mode": "same", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "name": "dropout_16", "p": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_23", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 64}, "class_name": "Convolution3D"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_24", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 64}, "class_name": "Convolution3D"}, {"config": {"strides": [3, 3, 3], "name": "maxpooling3d_12", "pool_size": [3, 3, 3], "border_mode": "same", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "name": "dropout_17", "p": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_6"}, "class_name": "Flatten"}, {"config": {"init": "normal", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 2048, "name": "dense_11", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "relu", "output_dim": 512}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_18", "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "normal", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 512, "name": "dense_12", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "linear", "output_dim": 101}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_6", "activation": "softmax"}, "class_name": "Activation"}]}, {"class_name": "Sequential", "config": [{"config": {"batch_input_shape": [null, 32, 32, 10, 3], "kernel_dim3": 3, "b_regularizer": null, "nb_filter": 32, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_25", "activity_regularizer": null, "input_dtype": "float32", "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "bias": true}, "class_name": "Convolution3D"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_26", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 32}, "class_name": "Convolution3D"}, {"config": {"strides": [3, 3, 3], "name": "maxpooling3d_13", "pool_size": [3, 3, 3], "border_mode": "same", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "name": "dropout_19", "p": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_27", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 64}, "class_name": "Convolution3D"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_28", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 64}, "class_name": "Convolution3D"}, {"config": {"strides": [3, 3, 3], "name": "maxpooling3d_14", "pool_size": [3, 3, 3], "border_mode": "same", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "name": "dropout_20", "p": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_7"}, "class_name": "Flatten"}, {"config": {"init": "normal", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 2048, "name": "dense_13", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "relu", "output_dim": 512}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_21", "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "normal", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 512, "name": "dense_14", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "linear", "output_dim": 101}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_7", "activation": "softmax"}, "class_name": "Activation"}]}, {"class_name": "Sequential", "config": [{"config": {"batch_input_shape": [null, 32, 32, 10, 3], "kernel_dim3": 3, "b_regularizer": null, "nb_filter": 32, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_29", "activity_regularizer": null, "input_dtype": "float32", "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "bias": true}, "class_name": "Convolution3D"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_30", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 32}, "class_name": "Convolution3D"}, {"config": {"strides": [3, 3, 3], "name": "maxpooling3d_15", "pool_size": [3, 3, 3], "border_mode": "same", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "name": "dropout_22", "p": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_31", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 64}, "class_name": "Convolution3D"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_32", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 64}, "class_name": "Convolution3D"}, {"config": {"strides": [3, 3, 3], "name": "maxpooling3d_16", "pool_size": [3, 3, 3], "border_mode": "same", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "name": "dropout_23", "p": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_8"}, "class_name": "Flatten"}, {"config": {"init": "normal", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 2048, "name": "dense_15", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "relu", "output_dim": 512}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_24", "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "normal", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 512, "name": "dense_16", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "linear", "output_dim": 101}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_8", "activation": "softmax"}, "class_name": "Activation"}]}, {"class_name": "Sequential", "config": [{"config": {"batch_input_shape": [null, 32, 32, 10, 3], "kernel_dim3": 3, "b_regularizer": null, "nb_filter": 32, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_33", "activity_regularizer": null, "input_dtype": "float32", "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "bias": true}, "class_name": "Convolution3D"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_34", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 32}, "class_name": "Convolution3D"}, {"config": {"strides": [3, 3, 3], "name": "maxpooling3d_17", "pool_size": [3, 3, 3], "border_mode": "same", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "name": "dropout_25", "p": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_35", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 64}, "class_name": "Convolution3D"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_36", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 64}, "class_name": "Convolution3D"}, {"config": {"strides": [3, 3, 3], "name": "maxpooling3d_18", "pool_size": [3, 3, 3], "border_mode": "same", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "name": "dropout_26", "p": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_9"}, "class_name": "Flatten"}, {"config": {"init": "normal", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 2048, "name": "dense_17", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "relu", "output_dim": 512}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_27", "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "normal", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 512, "name": "dense_18", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "linear", "output_dim": 101}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_9", "activation": "softmax"}, "class_name": "Activation"}]}, {"class_name": "Sequential", "config": [{"config": {"batch_input_shape": [null, 32, 32, 10, 3], "kernel_dim3": 3, "b_regularizer": null, "nb_filter": 32, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_37", "activity_regularizer": null, "input_dtype": "float32", "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "bias": true}, "class_name": "Convolution3D"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_38", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 32}, "class_name": "Convolution3D"}, {"config": {"strides": [3, 3, 3], "name": "maxpooling3d_19", "pool_size": [3, 3, 3], "border_mode": "same", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "name": "dropout_28", "p": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_39", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 64}, "class_name": "Convolution3D"}, {"config": {"kernel_dim3": 3, "b_regularizer": null, "bias": true, "kernel_dim1": 3, "W_regularizer": null, "border_mode": "same", "kernel_dim2": 3, "init": "glorot_uniform", "subsample": [1, 1, 1], "activation": "relu", "name": "convolution3d_40", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "nb_filter": 64}, "class_name": "Convolution3D"}, {"config": {"strides": [3, 3, 3], "name": "maxpooling3d_20", "pool_size": [3, 3, 3], "border_mode": "same", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "name": "dropout_29", "p": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_10"}, "class_name": "Flatten"}, {"config": {"init": "normal", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 2048, "name": "dense_19", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "relu", "output_dim": 512}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_30", "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "normal", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": 512, "name": "dense_20", "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "linear", "output_dim": 101}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_10", "activation": "softmax"}, "class_name": "Activation"}]}]}}], "class_name": "Sequential"}