{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_1", "bias": true, "init": "glorot_uniform", "input_dtype": "float32", "W_regularizer": null, "subsample": [1, 1], "border_mode": "same", "activity_regularizer": null, "nb_col": 3, "b_regularizer": null, "trainable": true, "activation": "linear", "batch_input_shape": [null, 32, 32, 1], "b_constraint": null, "nb_filter": 32, "nb_row": 3}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_2", "bias": true, "init": "glorot_uniform", "W_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null, "nb_col": 3, "b_regularizer": null, "trainable": true, "activation": "linear", "b_constraint": null, "nb_filter": 32, "nb_row": 3}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.25, "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_3", "bias": true, "init": "glorot_uniform", "W_regularizer": null, "subsample": [1, 1], "border_mode": "same", "activity_regularizer": null, "nb_col": 3, "b_regularizer": null, "trainable": true, "activation": "linear", "b_constraint": null, "nb_filter": 64, "nb_row": 3}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_4", "bias": true, "init": "glorot_uniform", "W_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null, "nb_col": 3, "b_regularizer": null, "trainable": true, "activation": "linear", "b_constraint": null, "nb_filter": 64, "nb_row": 3}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "name": "dense_1", "W_regularizer": null, "init": "glorot_uniform", "input_dim": 2304, "bias": true, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "linear", "output_dim": 512, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "name": "dense_2", "W_regularizer": null, "init": "glorot_uniform", "input_dim": 512, "bias": true, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "linear", "output_dim": 10, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "softmax"}}]}